Conf.Simple/src/InformationRegisters/SUI_СообщенияОбменаДанными/SUI_СообщенияОбменаДанными.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SUI_СообщенияОбменаДанными</name>
  <resources>
    <name>Данные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>ВидДанных</name>
    <type>
      <types>EnumRef.SUI_ВидыДанныхСообщенийОбменаДанными</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаписи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>МеткаВремени</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>30</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сворачивать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ID</name>
    <comment>Идентификатор сообщения</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Отправитель</name>
    <type>
      <types>ExchangePlanRef.SUI_МобильныеУстройства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Получатель</name>
    <type>
      <types>ExchangePlanRef.SUI_МобильныеУстройства</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Conf.Simple/src/Enums/SUI_ВидыДанныхСообщенийОбменаДанными/SUI_ВидыДанныхСообщенийОбменаДанными.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>SUI_ВидыДанныхСообщенийОбменаДанными</name>
  <enumValues>
    <name>Значение</name>
  </enumValues>
  <enumValues>
    <name>JSON</name>
  </enumValues>
</mdclass:Enum>

Conf.Simple/src/InformationRegisters/SUI_СообщенияОбменаДанными/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

//@skip-check bsl-variable-name-invalid
#Область ПрограммныйИнтерфейс

Функция ПараметрыПолученияСообщений() Экспорт
	
	Параметры = Новый Структура();
	
	Параметры.Вставить("Первые", 0);
	Параметры.Вставить("ID");
	Параметры.Вставить("Отправитель");
	Параметры.Вставить("Получатель");
	Параметры.Вставить("ДатаЗаписиБольше");
	Параметры.Вставить("ДатаЗаписиМеньше");
	
	Возврат Параметры;
	
КонецФункции

Функция ПолучитьСообщения(Параметры) Экспорт
	Возврат ЗапросПолученияСообщений(Параметры).Выполнить();
КонецФункции

Функция ПолучитьСообщенияПоОтправителю(Отправитель) Экспорт
	
	ПараметрыПолучения = ПараметрыПолученияСообщений();
	ПараметрыПолучения.Отправитель = Отправитель;
	
	Возврат ПолучитьСообщения(ПараметрыПолучения);
	
КонецФункции

Функция ПолучитьСообщенияПоПолучателю(Получатель) Экспорт
	
	ПараметрыПолучения = ПараметрыПолученияСообщений();
	ПараметрыПолучения.Получатель = Получатель;
	
	Возврат ПолучитьСообщения(ПараметрыПолучения);
	
КонецФункции

Функция ПолучитьПервоеСообщение(Параметры, ПолучитьИзХранилища = Истина) Экспорт
	
	Перем ДанныеСообщения;
	
	ПараметрыПолучения = ПараметрыПолученияСообщений();
	ПараметрыПолучения.Первые = 1;
	ПараметрыПолучения.ID = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ID");
	ПараметрыПолучения.Отправитель = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "Отправитель");
	ПараметрыПолучения.Получатель = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "Получатель");
	
	РезультатЗапроса = ПолучитьСообщения(ПараметрыПолучения);
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		ДанныеСообщения = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Выборка);
		
		Если ПолучитьИзХранилища Тогда
			ДанныеСообщения.Данные = ДанныеСообщения.Данные.Получить();
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ДанныеСообщения;
	
КонецФункции

Функция ПолучитьПервоеСообщениеПоОтправителю(Отправитель, ПолучитьИзХранилища = Истина) Экспорт
	
	ПараметрыПолучения = ПараметрыПолученияСообщений();
	ПараметрыПолучения.Отправитель = Отправитель;
	
	Возврат ПолучитьПервоеСообщение(ПараметрыПолучения, ПолучитьИзХранилища);
	
КонецФункции

Функция ПолучитьПервоеСообщениеПоПолучателю(Получатель, ПолучитьИзХранилища = Истина) Экспорт
	
	ПараметрыПолучения = ПараметрыПолученияСообщений();
	ПараметрыПолучения.Получатель = Получатель;
	
	Возврат ПолучитьПервоеСообщение(ПараметрыПолучения, ПолучитьИзХранилища);
	
КонецФункции

Функция ПолучитьСообщениеПоИдентификатору(ID, ПолучитьИзХранилища = Истина) Экспорт
	
	ПараметрыПолучения = ПараметрыПолученияСообщений();
	ПараметрыПолучения.ID = ID;
	
	Возврат ПолучитьПервоеСообщение(ПараметрыПолучения, ПолучитьИзХранилища);
	
КонецФункции

Функция Создать(Отправитель, Получатель, Знач Данные, Приоритет = 5, Знач ВидДанных = Неопределено, Знач ДополнительныеДанные = Неопределено) Экспорт
	
	ОписаниеТипаВидДанных = Новый ОписаниеТипов("ПеречислениеСсылка.SUI_ВидыДанныхСообщенийОбменаДанными");
	ВидДанных = ОписаниеТипаВидДанных.ПривестиЗначение(ВидДанных);
	Если ВидДанных.Пустая() Тогда
		ВидДанных = Перечисления.SUI_ВидыДанныхСообщенийОбменаДанными.Значение;
	КонецЕсли;
	
	ОписаниеТипаСтруктура = Новый ОписаниеТипов("Структура");
	ДополнительныеДанные = ОписаниеТипаСтруктура.ПривестиЗначение(ДополнительныеДанные);
	
	МеткаВремени = 0;
	Если ДополнительныеДанные.Свойство("МеткаВремени") Тогда
		МеткаВремени = ОбщегоНазначения.ОписаниеТипаЧисло(30).ПривестиЗначение(ДополнительныеДанные.МеткаВремени);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(МеткаВремени) Тогда
		МеткаВремени = ТекущаяУниверсальнаяДатаВМиллисекундах();
	КонецЕсли;
	
	ДатаЗаписи = Дата(1, 1, 1);
	Если ДополнительныеДанные.Свойство("ДатаЗаписи") Тогда
		ДатаЗаписи = ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя).ПривестиЗначение(ДополнительныеДанные.ДатаЗаписи);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДатаЗаписи) Тогда
		ДатаЗаписи = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Сворачивать = Истина;
	Если ДополнительныеДанные.Свойство("Сворачивать") Тогда
		Сворачивать = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеДанные, "Сворачивать", Ложь, Тип("Булево"));
	КонецЕсли;
	
	Если ВидДанных <> Перечисления.SUI_ВидыДанныхСообщенийОбменаДанными.Значение Тогда
		Сворачивать = Ложь;
	КонецЕсли;
	
	Данные = ПодготовитьДанныеСообщенияКЗаписи(Данные, ВидДанных);
	
	Если Данные = Неопределено Тогда
		ИдентификаторЗаписи = Неопределено;
	Иначе
		
		ИдентификаторЗаписи = НРег(ОбщегоНазначения.КонтрольнаяСуммаСтрокой(
			SUI_ОбщегоНазначенияКлиентСервер.МассивЗначений(
				Отправитель, 
				Получатель, 
				Новый УникальныйИдентификатор(), 
				МеткаВремени), 
			ХешФункция.SHA1)
		);
		
		МенеджерЗаписи = СоздатьМенеджерЗаписи();
		
		МенеджерЗаписи.ID 			= ИдентификаторЗаписи;
		МенеджерЗаписи.Отправитель 	= Отправитель;
		МенеджерЗаписи.Получатель 	= Получатель;
		МенеджерЗаписи.ДатаЗаписи 	= ДатаЗаписи;
		МенеджерЗаписи.Приоритет	= Приоритет;
		МенеджерЗаписи.ВидДанных 	= ВидДанных;
		МенеджерЗаписи.Данные		= Данные;
		МенеджерЗаписи.МеткаВремени	= МеткаВремени;
		МенеджерЗаписи.Сворачивать 	= Сворачивать;
		
		МенеджерЗаписи.Записать(Истина);
		
	КонецЕсли;
	
	Возврат ИдентификаторЗаписи;
	
КонецФункции

Функция ОбновитьСообщение(Знач ID, Знач Данные) Экспорт
	
	ОбщегоНазначенияКлиентСервер.Проверить(ЗначениеЗаполнено(ID),
		НСтр("ru = 'Не передан ID сообщения для обновления записи сообщения обмена данными.'"));
	
	Если Данные.Свойство("ID") Тогда
		Данные.Удалить("ID");
	КонецЕсли;
	
	Если Данные.Свойство("Отправитель") Тогда
		Данные.Удалить("Отправитель");
	КонецЕсли;
	
	Если Данные.Свойство("Получатель") Тогда
		Данные.Удалить("Получатель");
	КонецЕсли;
	
	Если Данные.Свойство("МеткаВремени") Тогда
		Данные.Удалить("МеткаВремени");
	КонецЕсли;
	
	Если Данные.Свойство("ВидДанных") Тогда
		ОписаниеТипаВидДанных = Новый ОписаниеТипов("ПеречислениеСсылка.SUI_ВидыДанныхСообщенийОбменаДанными");
		Данные.ВидДанных = ОписаниеТипаВидДанных.ПривестиЗначение(Данные.ВидДанных);
		Если Данные.ВидДанных.Пустая() Тогда
			Данные.Удалить("ВидДанных");
		КонецЕсли;
	КонецЕсли;
	
	Если Данные.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	SUI_СообщенияОбменаДанными.ID,
		|	SUI_СообщенияОбменаДанными.Отправитель,
		|	SUI_СообщенияОбменаДанными.Получатель,
		|	SUI_СообщенияОбменаДанными.Данные,
		|	SUI_СообщенияОбменаДанными.ВидДанных,
		|	SUI_СообщенияОбменаДанными.ДатаЗаписи,
		|	SUI_СообщенияОбменаДанными.МеткаВремени КАК МеткаВремени,
		|	SUI_СообщенияОбменаДанными.Приоритет,
		|	SUI_СообщенияОбменаДанными.Сворачивать
		|ИЗ
		|	РегистрСведений.SUI_СообщенияОбменаДанными КАК SUI_СообщенияОбменаДанными
		|ГДЕ
		|	SUI_СообщенияОбменаДанными.ID = &ID
		|
		|УПОРЯДОЧИТЬ ПО
		|	МеткаВремени";
	
	Запрос.УстановитьПараметр("ID", ID);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	НачатьТранзакцию();
	
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.SUI_СообщенияОбменаДанными");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Разделяемый;
		ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ID", "ID");
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Отправитель", "Отправитель");
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Получатель", "Получатель");
		Блокировка.Заблокировать();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Если Данные.Свойство("Данные") Тогда
				Данные.Данные = ПодготовитьДанныеСообщенияКЗаписи(Данные.Данные, 
					?(Данные.Свойство("ВидДанных"), Данные.ВидДанных, Выборка.ВидДанных));
				ОбщегоНазначенияКлиентСервер.Проверить(Данные.Данные <> Неопределено,
					НСтр("ru = 'Неудалось создать сообщение обмена данными. Сообщение не содержит данные.'"));
			КонецЕсли;
			
			НаборЗаписей = СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ID.Установить(Выборка.ID);
			НаборЗаписей.Отбор.Отправитель.Установить(Выборка.Отправитель);
			НаборЗаписей.Отбор.Получатель.Установить(Выборка.Получатель);
			
			ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), Выборка);
			ЗаполнитьЗначенияСвойств(НаборЗаписей[0], Данные);
			
			НаборЗаписей[0].ID = Выборка.ID;
			НаборЗаписей[0].Отправитель = Выборка.Отправитель;
			НаборЗаписей[0].Получатель = Выборка.Получатель;
			
			Если НаборЗаписей[0].ВидДанных = Перечисления.SUI_ВидыДанныхСообщенийОбменаДанными.JSON Тогда
				НаборЗаписей[0].Сворачивать = Ложь;
			КонецЕсли;
			
			НаборЗаписей.Записать(Истина);
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

Процедура Удалить(ID = Неопределено, Отправитель = Неопределено, Получатель = Неопределено) Экспорт
	
	НачатьТранзакцию();
	
	Попытка

		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.SUI_СообщенияОбменаДанными");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Разделяемый;
		
		Если ID <> Неопределено Тогда
			ЭлементБлокировки.УстановитьЗначение("ID", ID);
		КонецЕсли;
		
		Если Отправитель <> Неопределено Тогда
			ЭлементБлокировки.УстановитьЗначение("Отправитель", Отправитель);
		КонецЕсли;
		
		Если Получатель <> Неопределено Тогда
			ЭлементБлокировки.УстановитьЗначение("Получатель", Получатель);
		КонецЕсли;
		
		Блокировка.Заблокировать();
		
		НаборЗаписей = СоздатьНаборЗаписей();
		
		Если ID <> Неопределено Тогда
			НаборЗаписей.Отбор.ID.Установить(ID);
		КонецЕсли;
		
		Если Отправитель <> Неопределено Тогда
			НаборЗаписей.Отбор.Отправитель.Установить(Отправитель);
		КонецЕсли;
		
		Если Получатель <> Неопределено Тогда
			НаборЗаписей.Отбор.Получатель.Установить(Получатель);
		КонецЕсли;
	
		НаборЗаписей.Записать(Истина);

		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

Функция ПолучитьКоличествоСообщений(Параметры) Экспорт
	
	Результат = 0;
	
	УстановитьПривилегированныйРежим(Истина);
	
	РезультатЗапроса = ЗапросПолученияСообщений(Параметры, Истина).Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Результат = Выборка.ВсегоСообщений;
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьКоличествоСообщенийПоМобильнымУстройствам(Отправитель = Неопределено, Получатель = Неопределено) Экспорт
	
	Параметры = ПараметрыПолученияСообщений();
	Параметры.Отправитель = Отправитель;
	Параметры.Получатель = Получатель;
	
	ОбщегоНазначенияКлиентСервер.Проверить(Параметры.Отправитель <> Неопределено Или Параметры.Получатель <> Неопределено,
		НСтр("ru = 'Для получения количества сообщений необходимо указать отправителя или получателя'"));
	
	Возврат ПолучитьКоличествоСообщений(Параметры);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЗапросПолученияСообщений(Параметры, ПолучениеКоличества = Ложь)
	
	ВыборПервого = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "Первые", 0, Тип("Число"));
	
	Запрос = Новый Запрос;
	
	Если ПолучениеКоличества Тогда
		Запрос.Текст =
			"ВЫБРАТЬ
			|	КОЛИЧЕСТВО(СообщенияОбменаДанными.ID) КАК ВсегоСообщений
			|ИЗ
			|	РегистрСведений.SUI_СообщенияОбменаДанными КАК СообщенияОбменаДанными
			|ГДЕ
			|	ВЫБОР
			|		КОГДА &Отправитель = НЕОПРЕДЕЛЕНО
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ СообщенияОбменаДанными.Отправитель = &Отправитель
			|	КОНЕЦ
			|	И ВЫБОР
			|		КОГДА &Получатель = НЕОПРЕДЕЛЕНО
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ СообщенияОбменаДанными.Получатель = &Получатель
			|	КОНЕЦ
			|	И ВЫБОР
			|		КОГДА &ДатаЗаписиБольше = НЕОПРЕДЕЛЕНО
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ СообщенияОбменаДанными.ДатаЗаписи > &ДатаЗаписиБольше
			|	КОНЕЦ
			|	И ВЫБОР
			|		КОГДА &ДатаЗаписиМеньше = НЕОПРЕДЕЛЕНО
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ СообщенияОбменаДанными.ДатаЗаписи < &ДатаЗаписиМеньше
			|	КОНЕЦ";
	Иначе
		Запрос.Текст =
			"ВЫБРАТЬ " + ?(ВыборПервого = 0, "", "ПЕРВЫЕ " + Формат(ВыборПервого, "ЧДЦ=0; ЧГ=0;")) + "
			|	СообщенияОбменаДанными.ID,
			|	СообщенияОбменаДанными.Отправитель,
			|	СообщенияОбменаДанными.Получатель,
			|	СообщенияОбменаДанными.Данные,
			|	СообщенияОбменаДанными.ДатаЗаписи,
			|	СообщенияОбменаДанными.Приоритет,
			|	СообщенияОбменаДанными.ВидДанных,
			|	СообщенияОбменаДанными.МеткаВремени
			|ИЗ
			|	РегистрСведений.SUI_СообщенияОбменаДанными КАК СообщенияОбменаДанными
			|ГДЕ
			|	ВЫБОР
			|		КОГДА &ID = НЕОПРЕДЕЛЕНО
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ СообщенияОбменаДанными.ID = &ID
			|	КОНЕЦ
			|	И ВЫБОР
			|		КОГДА &Отправитель = НЕОПРЕДЕЛЕНО
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ СообщенияОбменаДанными.Отправитель = &Отправитель
			|	КОНЕЦ
			|	И ВЫБОР
			|		КОГДА &Получатель = НЕОПРЕДЕЛЕНО
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ СообщенияОбменаДанными.Получатель = &Получатель
			|	КОНЕЦ
			|	И ВЫБОР
			|		КОГДА &ДатаЗаписиБольше = НЕОПРЕДЕЛЕНО
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ СообщенияОбменаДанными.ДатаЗаписи > &ДатаЗаписиБольше
			|	КОНЕЦ
			|	И ВЫБОР
			|		КОГДА &ДатаЗаписиМеньше = НЕОПРЕДЕЛЕНО
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ СообщенияОбменаДанными.ДатаЗаписи < &ДатаЗаписиМеньше
			|	КОНЕЦ
			|
			|УПОРЯДОЧИТЬ ПО
			|	Приоритет УБЫВ,
			|	МеткаВремени";
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ID", 				SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ID"));
	Запрос.УстановитьПараметр("Отправитель", 		SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "Отправитель"));
	Запрос.УстановитьПараметр("Получатель", 		SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "Получатель"));
	Запрос.УстановитьПараметр("ДатаЗаписиБольше", 	SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ДатаЗаписиБольше"));
	Запрос.УстановитьПараметр("ДатаЗаписиМеньше", 	SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ДатаЗаписиМеньше"));
	
	Возврат Запрос;
	
КонецФункции

Функция ПодготовитьДанныеСообщенияКЗаписи(Знач Сообщение, ВидДанных)
	
	Если ТипЗнч(Сообщение) = Тип("Строка") И ЭтоАдресВременногоХранилища(Сообщение) Тогда
		Адрес = Сообщение;
		Сообщение = ПолучитьИзВременногоХранилища(Адрес);
		УдалитьИзВременногоХранилища(Адрес);
	КонецЕсли;
	
	Если ВидДанных = Перечисления.SUI_ВидыДанныхСообщенийОбменаДанными.JSON Тогда
		Сообщение = SUI_СообщенияОбменаДанными.ДанныеСообщенияВJSON(Сообщение);
	КонецЕсли;
	
	Если Сообщение = Неопределено Тогда
		Возврат Неопределено;
	Иначе
		Возврат Новый ХранилищеЗначения(Сообщение, Новый СжатиеДанных(9));
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецЕсли
